{
  "es": {
    "titleTap": "Perfil profesional",
    "position": "Desarrollador Frontend Senior",
    "description": "<p>Ingeniero de desarrollo con más de 10 años de experiencia, especializado en la creación de soluciones escalables y de fácil mantenimiento mediante la aplicación de arquitecturas y patrones de diseño robustos. Mi enfoque se centra en mejorar la legibilidad del código y la organización de proyectos para optimizar el ciclo de desarrollo.</p> <p>Poseo un sólido dominio de JavaScript y su ecosistema de frameworks y librerías. Adicionalmente, mi formación como diseñador multimedia me proporciona un fuerte conocimiento en UI/UX, lo que me permite crear interfaces más intuitivas y colaborar eficazmente con equipos de diseño. Mi nivel de inglés B1 me facilita la comprensión de documentación técnica y la comunicación en entornos internacionales.</p>",
    "titleSkill": "Habilidades",
    "skills": [
      {
        "order": 1,
        "icon": "./assets/usa-logo.svg",
        "language": "Inglés B1+"
      },
      {
        "order": 2,
        "icon": "./assets/html-logo.svg",
        "language": "HTML"
      },
      {
        "order": 3,
        "icon": "./assets/css-logo.svg",
        "language": "CSS"
      },
      {
        "order": 4,
        "icon": "./assets/javascript-logo.svg",
        "language": "Javascript"
      },
      {
        "order": 5,
        "icon": "./assets/typescript-logo.svg",
        "language": "Typescript"
      },
      {
        "order": 6,
        "icon": "./assets/react-logo.svg",
        "language": "React"
      },
      {
        "order": 7,
        "icon": "./assets/angular-logo.svg",
        "language": "Angular"
      },
      {
        "order": 8,
        "icon": "./assets/nodejs-logo.svg",
        "language": "NodeJs"
      },
      {
        "order": 9,
        "icon": "./assets/mongodb-logo.svg",
        "language": "MongoDB (Mongoose)"
      },
      {
        "order": 10,
        "icon": "./assets/express-logo.svg",
        "language": "Express"
      },
      {
        "order": 11,
        "icon": "./assets/jest-logo.svg",
        "language": "Pruebas (Jest)"
      },
      {
        "order": 13,
        "icon": "./assets/mysql-logo.svg",
        "language": "MySql"
      },
      {
        "order": 14,
        "icon": "./assets/git-logo.svg",
        "language": "Git"
      },
      {
        "order": 15,
        "icon": "./assets/github-logo.svg",
        "language": "Github"
      }
    ],
    "titleExp": "Experiencia laboral",
    "workExp": [
      {
        "company": "Servinformción",
        "start_date": "Septiembre 2021",
        "end_date": "",
        "position": "Ingeniero de desarrollo",
        "descExp": "Como desarrollador Front-end en Servinformación, he sido responsable de construir componentes reutilizables y escalables para nuestras aplicaciones web, utilizando tecnologías como JavaScript, React, Angular y Vue. Mis proyectos han contribuido a mejorar la experiencia del usuario y optimizar el rendimiento de nuestras plataformas, alineadas con las soluciones de Google Cloud Platform y Firebase.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Github",
          "TypeScript",
          "React",
          "Angular",
          "Vuejs"
        ]
      },
      {
        "company": "Zuntek",
        "start_date": "Abril 2021",
        "end_date": "Agosto 2021",
        "position": "Analista de desarrollo de software",
        "descExp": "Adquirí experiencia en el diseño e implementación de sistemas de autenticación y autorización robustos. Participé en el desarrollo de una plataforma que permitía crear módulos personalizados, como el módulo de empresas, basados en la asignación de roles y permisos específicos a los usuarios.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Github",
          "TypeScript",
          "Angular",
          "Php (Laravel)"
        ]
      },
      {
        "company": "El Cubo Creativo",
        "start_date": "Diciembre 2020",
        "end_date": "Noviembre 2021",
        "position": "Desarrollador de aplicaciones",
        "descExp": "Extendí las funcionalidades de un proyecto existente, inicialmente limitado, para adaptarlo a las necesidades de una plataforma a gran escala. Desarrollé módulos como categorías, productos y usuarios, implementando un sistema de roles y permisos que permitió una gestión granular de los accesos y una mayor flexibilidad en la administración de la plataforma.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Github",
          "TypeScript",
          "Angular",
          "Ionic"
        ]
      },
      {
        "company": "Redlat Agencia Digital",
        "start_date": "Marzo 2020",
        "end_date": "Junio 2020",
        "position": "Desarrollador web",
        "descExp": "Para ofrecer una solución personalizada y escalable, diseñé y desarrollé plugins específicos para el tema de WordPress de nuestra plataforma. Estos plugins, creados desde cero, permitieron una integración profunda con la base de datos, utilizando PHP y MySQL para almacenar y gestionar la nueva información. La compatibilidad con la versión de PHP existente fue un factor clave en el desarrollo de estos plugins.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Github",
          "Wordpress",
          "Php"
        ]
      },
      {
        "company": "Vectorial",
        "start_date": "Noviembre 2019",
        "end_date": "Marzo 2020",
        "position": "Desarrollador web",
        "descExp": "En Vectorial, contribuí a la creación de experiencias de usuario excepcionales a través del desarrollo de plataformas web en WordPress. Aprovechando las capacidades de custom fields, taxonomías y tags, diseñé soluciones que permitieron a los usuarios interactuar de manera más profunda con el contenido y descubrir información relevante de forma sencilla.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Gitlab",
          "Wordpress",
          "Php"
        ]
      },
      {
        "company": "Aladdin Casino",
        "start_date": "Septiembre 2014",
        "end_date": "Noviembre 2019",
        "position": "Desarrollador web",
        "descExp": "En Casinos Aladdin, construí una solución web completa y escalable, desde la estructura hasta la interfaz de usuario. Utilizando tecnologías como HTML5, CSS3, JavaScript, PHP y MySQL, desarrollé un tema de WordPress personalizado que permitiera una gestión flexible del contenido y una experiencia de usuario intuitiva.",
        "toolsApply": ["Html", "Css", "JavaScript", "Wordpress", "Php", "MySQL"]
      }
    ]
  },
  "en": {
    "titleTap": "Persona profile",
    "position": "Senior Frontend Developer",
    "description": "<p>Development Engineer with over 10 years of experience, specializing in creating scalable and easily maintainable solutions through the application of robust architectures and design patterns. My focus is on improving code readability and project organization to optimize the development lifecycle.</p> <p>I possess a strong command of JavaScript and its ecosystem of frameworks and libraries. Additionally, my background as a multimedia designer provides me with a solid understanding of UI/UX principles, enabling me to create more intuitive interfaces and collaborate effectively with design teams. My B1 level of English allows me to easily understand technical documentation and communicate in international environments.</p>",
    "titleSkill": "Skills",
    "skills": [
      {
        "order": 1,
        "icon": "./assets/usa-logo.svg",
        "language": "Inglés B1+"
      },
      {
        "order": 2,
        "icon": "./assets/html-logo.svg",
        "language": "HTML"
      },
      {
        "order": 3,
        "icon": "./assets/css-logo.svg",
        "language": "CSS"
      },
      {
        "order": 4,
        "icon": "./assets/javascript-logo.svg",
        "language": "Javascript"
      },
      {
        "order": 5,
        "icon": "./assets/typescript-logo.svg",
        "language": "Typescript"
      },
      {
        "order": 6,
        "icon": "./assets/react-logo.svg",
        "language": "React"
      },
      {
        "order": 7,
        "icon": "./assets/angular-logo.svg",
        "language": "Angular"
      },
      {
        "order": 8,
        "icon": "./assets/nodejs-logo.svg",
        "language": "NodeJs"
      },
      {
        "order": 9,
        "icon": "./assets/mongodb-logo.svg",
        "language": "MongoDB (Mongoose)"
      },
      {
        "order": 10,
        "icon": "./assets/express-logo.svg",
        "language": "Express"
      },
      {
        "order": 11,
        "icon": "./assets/jest-logo.svg",
        "language": "Pruebas (Jest)"
      },
      {
        "order": 13,
        "icon": "./assets/mysql-logo.svg",
        "language": "MySql"
      },
      {
        "order": 14,
        "icon": "./assets/git-logo.svg",
        "language": "Git"
      },
      {
        "order": 15,
        "icon": "./assets/github-logo.svg",
        "language": "Github"
      }
    ],
    "titleExp": "Work Experience",
    "workExp": [
      {
        "company": "Servinformción",
        "start_date": "September 2021",
        "end_date": "",
        "position": "Development engineer",
        "descExp": "As a Front-end Developer at Servinformación, I have been responsible for building reusable and scalable components for our web applications, utilizing technologies such as JavaScript, React, Angular, and Vue. My projects have contributed to enhancing user experience and optimizing the performance of our platforms, aligned with Google Cloud Platform and Firebase solutions.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Github",
          "TypeScript",
          "React",
          "Angular",
          "Vuejs"
        ]
      },
      {
        "company": "Zuntek",
        "start_date": "April 2021",
        "end_date": "August 2021",
        "position": "Software development analyst",
        "descExp": "I specialized in designing and implementing secure authentication and authorization systems. I was involved in building a platform that enabled the creation of tailored modules, such as a company module, by assigning specific roles and permissions to different user groups.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Github",
          "TypeScript",
          "Angular"
        ]
      },
      {
        "company": "El Cubo Creativo",
        "start_date": "December 2020",
        "end_date": "November 2021",
        "position": "App developer",
        "descExp": "I expanded the functionalities of an existing, limited project to accommodate the needs of a large-scale platform. I developed modules such as categories, products, and users, implementing a role-based access control system that enabled granular access management and greater flexibility in platform administration.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Github",
          "Wordpress",
          "Php"
        ]
      },
      {
        "company": "Redlat Agencia Digital",
        "start_date": "March 2020",
        "end_date": "June 2020",
        "position": "Web developer",
        "descExp": "To provide a customized and scalable solution, I designed and developed specific plugins for our platform's WordPress theme. These plugins, created from scratch, allowed for deep integration with the database, utilizing PHP and MySQL to store and manage the new information. Compatibility with the existing PHP version was a key factor in the development of these plugins.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Github",
          "TypeScript",
          "Angular",
          "Ionic"
        ]
      },
      {
        "company": "Vectorial",
        "start_date": "November 2019",
        "end_date": "March 2020",
        "position": "Web developer",
        "descExp": "I developed WordPress platforms at Vectorial, focusing on creating exceptional user experiences. I used custom fields, taxonomies, and tags to enable deeper content interactions and easier discovery.",
        "toolsApply": [
          "Html",
          "Css",
          "JavaScript",
          "Git",
          "Gitlab",
          "Wordpress",
          "Php"
        ]
      },
      {
        "company": "Aladdin Casino",
        "start_date": "September 2014",
        "end_date": "November 2019",
        "position": "Desarrollador web",
        "descExp": "At Casinos Aladdin, I built a comprehensive and scalable web solution, from the structure to the user interface. Utilizing technologies such as HTML5, CSS3, JavaScript, PHP, and MySQL, I developed a custom WordPress theme that enabled flexible content management and an intuitive user experience.",
        "toolsApply": ["Html", "Css", "JavaScript", "Wordpress", "Php", "MySQL"]
      }
    ]
  }
}
